pycom/pycom-micropython-sigfox/esp32/sigfox/modsigfox.c
        /* Check that we have bytes in the fifo */
        if (rxlastindex != 0) {
            // read marcstate to check for RX FIFO error
            cc112xSpiReadReg(CC112X_MARCSTATE, &status, 1);

            // mask out marcstate bits and check if we have a RX FIFO error
            if ((status & 0x1F) == RX_FIFO_ERROR && (rxlastindex + 1 < sizeof(rx_data.data))) {
                // flush the RX Fifo
                trxSpiCmdStrobe(CC112X_SFRX);
            } else {
                // read n bytes from rx fifo
                cc112xSpiReadRxFifo(rx_data.data, rxlastindex + 1);

                // Once read, Flush RX Fifo
                trxSpiCmdStrobe(CC112X_SFRX);

                // check CRC ok (CRC_OK: bit7 in second status byte)
                // this assumes status bytes are appended in RX_FIFO
                // (PKT_CFG1.APPEND_STATUS = 1.)
                // if CRC is disabled the CRC_OK field will read 1
                if (rx_data.data[rxlastindex] & 0x80) {
                    rx_data.len = rx_data.data[0];
                    memmove(rx_data.data, &rx_data.data[1], rx_data.data[0]);
                    xQueueSend(xRxQueue, (void *)&rx_data, 0);
                }
            }
        }

        // reset the packet semaphore
        trxSpiCmdStrobe(CC112X_SIDLE);
        packetSemaphore = ISR_IDLE;
        sigfox_obj.state = E_SIGFOX_STATE_IDLE;
    }
}

static void fsk_register_config(void) {
    // reset the radio
    trxSpiCmdStrobe(CC112X_SRES);

    // write registers to radio
    for(uint16 i = 0; i < sizeof(cc1125PreferredSettings) / sizeof(registerSetting_t); i++) {
        uint8 writeByte = cc1125PreferredSettings[i].data;
        cc112xSpiWriteReg( cc1125PreferredSettings[i].addr, &writeByte, 1);
    }
}

static void fsk_tx_register_config(void) {
    // write registers to radio
    for(uint16 i = 0; i < sizeof(cc1125TxSettings) / sizeof(registerSetting_t); i++) {
        uint8 writeByte = cc1125TxSettings[i].data;
        cc112xSpiWriteReg( cc1125TxSettings[i].addr, &writeByte, 1);
    }
}

static void fsk_rx_register_config(void) {
    // write registers to radio
    for(uint16 i = 0; i < sizeof(cc1125RxSettings) / sizeof(registerSetting_t); i++) {
        uint8 writeByte = cc1125RxSettings[i].data;
        cc112xSpiWriteReg( cc1125RxSettings[i].addr, &writeByte, 1);
    }
}

static void fsk_manual_calibration(void) {

    #define VCDAC_START_OFFSET                  (2)
    #define FS_VCO2_INDEX                       (0)
    #define FS_VCO4_INDEX                       (1)
    #define FS_CHP_INDEX                        (2)

    uint8 original_fs_cal2;
    uint8 calResults_for_vcdac_start_high[3];
    uint8 calResults_for_vcdac_start_mid[3];
    uint8 marcstate;
    uint8 writeByte;

    // set VCO cap-array to 0 (FS_VCO2 = 0x00)
    writeByte = 0x00;
    cc112xSpiWriteReg(CC112X_FS_VCO2, &writeByte, 1);

    // start with high VCDAC (original VCDAC_START + 2):
    cc112xSpiReadReg(CC112X_FS_CAL2, &original_fs_cal2, 1);
    writeByte = original_fs_cal2 + VCDAC_START_OFFSET;
    cc112xSpiWriteReg(CC112X_FS_CAL2, &writeByte, 1);

    // calibrate and wait for calibration to be done (radio back in IDLE state)
    trxSpiCmdStrobe(CC112X_SCAL);

    do {
        cc112xSpiReadReg(CC112X_MARCSTATE, &marcstate, 1);
    } while (marcstate != 0x41);

    // read FS_VCO2, FS_VCO4 and FS_CHP register obtained with high VCDAC_START value
    cc112xSpiReadReg(CC112X_FS_VCO2, &calResults_for_vcdac_start_high[FS_VCO2_INDEX], 1);
    cc112xSpiReadReg(CC112X_FS_VCO4, &calResults_for_vcdac_start_high[FS_VCO4_INDEX], 1);
    cc112xSpiReadReg(CC112X_FS_CHP, &calResults_for_vcdac_start_high[FS_CHP_INDEX], 1);

    // set VCO cap-array to 0 (FS_VCO2 = 0x00)
    writeByte = 0x00;
    cc112xSpiWriteReg(CC112X_FS_VCO2, &writeByte, 1);

    // continue with mid VCDAC (original VCDAC_START):
    writeByte = original_fs_cal2;
    cc112xSpiWriteReg(CC112X_FS_CAL2, &writeByte, 1);

    // calibrate and wait for calibration to be done (radio back in IDLE state)
    trxSpiCmdStrobe(CC112X_SCAL);

    do {
        cc112xSpiReadReg(CC112X_MARCSTATE, &marcstate, 1);
    } while (marcstate != 0x41);

    // read FS_VCO2, FS_VCO4 and FS_CHP register obtained with mid VCDAC_START value
    cc112xSpiReadReg(CC112X_FS_VCO2, &calResults_for_vcdac_start_mid[FS_VCO2_INDEX], 1);
    cc112xSpiReadReg(CC112X_FS_VCO4, &calResults_for_vcdac_start_mid[FS_VCO4_INDEX], 1);
    cc112xSpiReadReg(CC112X_FS_CHP, &calResults_for_vcdac_start_mid[FS_CHP_INDEX], 1);

    // write back highest FS_VCO2 and corresponding FS_VCO and FS_CHP result
    if (calResults_for_vcdac_start_high[FS_VCO2_INDEX] > calResults_for_vcdac_start_mid[FS_VCO2_INDEX]) {
        writeByte = calResults_for_vcdac_start_high[FS_VCO2_INDEX];
        cc112xSpiWriteReg(CC112X_FS_VCO2, &writeByte, 1);
        writeByte = calResults_for_vcdac_start_high[FS_VCO4_INDEX];
        cc112xSpiWriteReg(CC112X_FS_VCO4, &writeByte, 1);
        writeByte = calResults_for_vcdac_start_high[FS_CHP_INDEX];
        cc112xSpiWriteReg(CC112X_FS_CHP, &writeByte, 1);
    } else {
        writeByte = calResults_for_vcdac_start_mid[FS_VCO2_INDEX];
        cc112xSpiWriteReg(CC112X_FS_VCO2, &writeByte, 1);
        writeByte = calResults_for_vcdac_start_mid[FS_VCO4_INDEX];
        cc112xSpiWriteReg(CC112X_FS_VCO4, &writeByte, 1);
        writeByte = calResults_for_vcdac_start_mid[FS_CHP_INDEX];
        cc112xSpiWriteReg(CC112X_FS_CHP, &writeByte, 1);
    }
}

static void sigfox_send_cmd (sigfox_cmd_rx_data_t *cmd_rx_data) {
    xEventGroupClearBits(sigfoxEvents, SIGFOX_STATUS_COMPLETED | SIGFOX_STATUS_ERR);

    xQueueSend(xCmdQueue, (void *)cmd_rx_data, (TickType_t)portMAX_DELAY);

    uint32_t result = xEventGroupWaitBits(sigfoxEvents,
                                          SIGFOX_STATUS_COMPLETED | SIGFOX_STATUS_ERR,
                                          pdTRUE,   // clear on exit
                                          pdFALSE,  // do not wait for all bits
                                          (TickType_t)portMAX_DELAY);

    if (result & SIGFOX_STATUS_ERR) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
    }
}

