pycom/pycom-micropython-sigfox/esp32/sigfox/modsigfox.c
mp_obj_t sigfox_public_key(mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args == 1) {
        if (usePublicKey == SFX_TRUE) {
            return mp_const_true;
        }
        return mp_const_false;
    } else {
        if (mp_obj_is_true(args[1])) {
            usePublicKey = SFX_TRUE;
        } else {
            usePublicKey = SFX_FALSE;
        }
        return mp_const_none;
    }
}

mp_obj_t sigfox_rssi(mp_obj_t self_in) {
    int8_t rssi;
    MANUF_API_get_rssi(&rssi);
    rssi -= 100;   // Sigfox backend compatibility
    return MP_OBJ_NEW_SMALL_INT(rssi);
}

mp_obj_t sigfox_rssi_offset(mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args == 1) {
        int16_t rssi_offset;
        if (SFX_ERR_MANUF_NONE != MANUF_API_get_nv_mem(SFX_NVMEM_RSSI, (sfx_u16 *)&rssi_offset)) {
            rssi_offset = 0;
        }
        return mp_obj_new_int(rssi_offset);
    } else {
        if (SFX_ERR_MANUF_NONE != MANUF_API_set_nv_mem(SFX_NVMEM_RSSI, mp_obj_get_int(args[1]))) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
        }
        return mp_const_none;
    }
}

mp_obj_t sigfox_freq_offset(mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args == 1) {
        int16_t freq_offset;
        if (SFX_ERR_MANUF_NONE != MANUF_API_get_nv_mem(SFX_NVMEM_FREQ, (sfx_u16 *)&freq_offset)) {
            freq_offset = 0;
        }
        return mp_obj_new_int(freq_offset);
    } else {
        if (mp_obj_get_int(args[1]) > INT16_MAX || mp_obj_get_int(args[1]) < INT16_MIN) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "the freq offset is out of range (-32768 < freq_offset < 32767)"));
        }

        if (SFX_ERR_MANUF_NONE != MANUF_API_set_nv_mem(SFX_NVMEM_FREQ, mp_obj_get_int(args[1]))) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
        }
        return mp_const_none;
    }
}

mp_obj_t sigfox_version(mp_obj_t self_in) {
    sfx_u8 *ptr;
    sfx_u8 size;

    if (SFX_ERR_NONE == SIGFOX_API_get_version(&ptr, &size)) {
        return mp_obj_new_str((char *)ptr, size - 1, false);
    }
    nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
}

mp_obj_t sigfox_info(mp_obj_t self_in) {
    sfx_u8 info;

    if (sfx_rcz_id != E_SIGFOX_RCZ1) {
        if (SFX_ERR_NONE == SIGFOX_API_get_info(&info)) {
            mp_obj_t tuple[2];
            if (sfx_rcz_id == E_SIGFOX_RCZ3) {  // RCZ3 - LBT
                tuple[0] = mp_obj_new_int(info & 0b00000111);   // Frames sent
                tuple[1] = mp_obj_new_int(info & 0b11111000);   // Carrier sense attempts
            } else {
                tuple[0] = mp_obj_new_int(info & 0b00001111);   // FCC channel not default
                tuple[1] = mp_obj_new_int(info & 0b11110000);   // Number of free micro channel
            }
            return mp_obj_new_tuple(2, tuple);
        }
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
    }
    return mp_const_none;
}

mp_obj_t sigfox_reset(mp_obj_t self_in) {
    // only for RCZ2 and RCZ4
    if (sfx_rcz_id == E_SIGFOX_RCZ2 || sfx_rcz_id == E_SIGFOX_RCZ4) {
        SIGFOX_API_reset();
    }
    return mp_const_none;
}

///******************************************************************************/
//// Micro Python bindings; Sigfox socket

int sigfox_socket_socket (mod_network_socket_obj_t *s, int *_errno) {
    if (sigfox_obj.state == E_SIGFOX_STATE_NOINIT) {
        *_errno = MP_ENETDOWN;
        return -1;
    }
    s->sock_base.u.sd = 1;
    SIGFOX_SOCKET_SET_RX(s->sock_base.u.sd, false);
    SIGFOX_SOCKET_SET_TX_REPEAT(s->sock_base.u.sd, 2);
    SIGFOX_SOCKET_SET_OOB(s->sock_base.u.sd, false);
    return 0;
}

void sigfox_socket_close (mod_network_socket_obj_t *s) {
    // this is to prevent the finalizer to close a socket that failed during creation
    if (s->sock_base.u.sd > 0) {
        s->sock_base.u.sd = -1;
    }
}

int sigfox_socket_send(mod_network_socket_obj_t *s, const byte *buf, mp_uint_t len, int *_errno) {
    sigfox_cmd_rx_data_t cmd_rx_data;
    SIGFOX_CHECK_SOCKET(s);

    uint8_t maxlen = (sigfox_obj.mode == E_SIGFOX_MODE_SIGFOX) ? SIGFOX_TX_PAYLOAD_SIZE_MAX : FSK_TX_PAYLOAD_SIZE_MAX;

    if (len > maxlen) {
        *_errno = MP_EMSGSIZE;
        return -1;
    }

    cmd_rx_data.cmd_u.cmd = E_SIGFOX_CMD_TX;
    cmd_rx_data.cmd_u.info.tx.len = len;
    cmd_rx_data.cmd_u.info.tx.tx_repeat = SIGFOX_SOCKET_GET_TX_REPEAT(s->sock_base.u.sd);
    cmd_rx_data.cmd_u.info.tx.receive = SIGFOX_SOCKET_GET_RX(s->sock_base.u.sd) ? SFX_TRUE : SFX_FALSE;
    cmd_rx_data.cmd_u.info.tx.oob = SIGFOX_SOCKET_GET_OOB(s->sock_base.u.sd);
    if (len > 0) {
        memcpy(cmd_rx_data.cmd_u.info.tx.data, buf, len);
    } else {
        if (SIGFOX_SOCKET_GET_BIT(s->sock_base.u.sd)) {
            cmd_rx_data.cmd_u.info.tx.data[0] = 1;
        } else {
            cmd_rx_data.cmd_u.info.tx.data[0] = 0;
        }
    }

    int32_t timeout_ms = s->sock_base.timeout;
    if (timeout_ms < 0) {
        // blocking mode
        timeout_ms = portMAX_DELAY;
    }

    xEventGroupClearBits(sigfoxEvents, SIGFOX_STATUS_COMPLETED | SIGFOX_STATUS_ERR);

    // just pass it to the Sigfox queue
    if (!xQueueSend(xCmdQueue, (void *)&cmd_rx_data, (TickType_t)(timeout_ms / portTICK_PERIOD_MS))) {
        *_errno = MP_EAGAIN;
        return -1;
    }

    if (timeout_ms != 0) {
        uint32_t result = xEventGroupWaitBits(sigfoxEvents,
                                              SIGFOX_STATUS_COMPLETED | SIGFOX_STATUS_ERR,
                                              pdTRUE,   // clear on exit
                                              pdFALSE,  // do not wait for all bits
                                             (TickType_t)portMAX_DELAY);
        if (result & SIGFOX_STATUS_ERR) {
            *_errno = MP_ENETDOWN;
            return -1;
        }
    }

    return len;
}

int sigfox_socket_recv (mod_network_socket_obj_t *s, byte *buf, mp_uint_t len, int *_errno) {
    SIGFOX_CHECK_SOCKET(s);
    int ret = sigfox_recv (buf, len, s->sock_base.timeout);
    if (ret < 0) {
        *_errno = MP_EAGAIN;
        return -1;
    }
    return ret;
}

int sigfox_socket_setsockopt(mod_network_socket_obj_t *s, mp_uint_t level, mp_uint_t opt, const void *optval, mp_uint_t optlen, int *_errno) {
    SIGFOX_CHECK_SOCKET(s);
    if (level != SOL_SIGFOX) {
        *_errno = MP_EOPNOTSUPP;
        return -1;
    }

    if (opt == SO_SIGFOX_RX) {
        SIGFOX_SOCKET_SET_RX(s->sock_base.u.sd, *(uint8_t *)optval);
    } else if (opt == SO_SIGFOX_TX_REPEAT) {
        uint8_t tx_repeat = *(uint8_t *)optval;
        if (tx_repeat > 2) {
            *_errno = MP_EOPNOTSUPP;
            return -1;
        }
        SIGFOX_SOCKET_SET_TX_REPEAT(s->sock_base.u.sd, tx_repeat);
    } else if (opt == SO_SIGFOX_OOB) {
        SIGFOX_SOCKET_SET_OOB(s->sock_base.u.sd, *(uint8_t *)optval);
    } else if (opt == SO_SIGFOX_BIT) {
        SIGFOX_SOCKET_SET_BIT(s->sock_base.u.sd, *(uint8_t *)optval);
    } else {
        *_errno = MP_EOPNOTSUPP;
        return -1;
    }
    return 0;
}

int sigfox_socket_settimeout (mod_network_socket_obj_t *s, mp_int_t timeout_ms, int *_errno) {
    SIGFOX_CHECK_SOCKET(s);
    s->sock_base.timeout = timeout_ms;
    return 0;
}

int sigfox_socket_ioctl (mod_network_socket_obj_t *s, mp_uint_t request, mp_uint_t arg, int *_errno) {
    mp_int_t ret = 0;

    SIGFOX_CHECK_SOCKET(s);
    if (request == MP_IOCTL_POLL) {
        mp_uint_t flags = arg;
        if ((flags & MP_IOCTL_POLL_RD) && sigfox_rx_any()) {
            ret |= MP_IOCTL_POLL_RD;
        }
        if ((flags & MP_IOCTL_POLL_WR) && sigfox_tx_space()) {
            ret |= MP_IOCTL_POLL_WR;
        }
    } else {
        *_errno = MP_EINVAL;
        ret = MP_STREAM_ERROR;
    }
    return ret;
}
